import { Building } from '../../types/common';

const R = () => (
  <>
    법학과와 시각디자인과가 위치한 정문 건물. 홍익대 정문은 ‘세계에서 가장 큰 대학교 정문’으로
    기네스북에 등재되어 있다. 홍문풍이라고 불리는 아주 강한 바람이 부는데, 이 바람에 지나다니는
    미대생들이 작품이 파손되는 일이 잦다.
    <br />
    7층은 시디과의 본거지. 야작하고 밤에 보는 ㅎㅇㅅㄷ 창문으로 보는 야경이 예쁘다. 새벽에는 중앙
    엘레베이터 운행이 중지되기 때문에, 르방 엘레베이터라고 불리던 이 창문 앞 엘레베이터를 이용해서
    지하주차장으로 나와야 했다.
  </>
);

const K = () => (
  <>
    기계, 도시, 신소재가 사용하는 공대생 건물. 공대 학생회실도 여기에 위치. 6층엔 열람실이 있고,
    1층과 2층엔 대형 계단식 강의실이 있다. 4층은 와우관쪽으로 연결된다.
    <br />
    케냥이(K동 고양이)라고 불리는 홍대의 마스코트 고양이들 서식지이다.
  </>
);

const L = () => (
  <>
    건축대생이 쓰는 건물로, 건축 설계실이 많다. 건축학도들의 힘겨워하는 모습을 볼 수 있다. 4층에는
    와편(와우편의점)이라고 불리는 편의점이 있다. 학생회관과 K동 양쪽으로 나아가 수 있고, 8층은
    I동으로 연결된다.
  </>
);

const J = () => <>와우관 뒷편에 있는 건축대 공간.</>;

const I = () => (
  <>
    화공, 기초과학과가 사용하는 건물로, 과학 실험실이 위치해 공대생들이 실험들으러 가는 곳이다.
    엘레베이터가 없고 홍대에서 가장 접근하기 어려운 건물. 와우관 8층과 연결되어있고, P동과도 층마다
    한 층 차이로 연결된다.
  </>
);

const G = () => (
  <>
    학생회관, 총학생회, 방송국, 총동연, 학사지원팀, 동아리방이 위치해있다.
    <br />
    1층: 인쇄소에서 모든 싸강의 강의록을 판매하고 있다.
    <br />
    2층: 여휴라고 불리는 여학생 휴게실. 바닥이 따땃하고 이불 깔고 잘 수 있다.
    <br />
    5층과 6층: 중앙도서관 열람실로 이용. 중앙도서관과 연결되는데 연결로에는 카페가 있다.
    <br />
    지하: 홍아지트라는 학교 식당이 있다.
  </>
);

const H = () => (
  <>
    처음 가면 은근 찾기 어려운 중앙도서관. 와우관 4층, Q동 엘레베이터 타고 8층에서 내린 다음 중앙
    엘레베이터로 환승, 7층 참고열람실로 직행.
    <br />
    2층에는 블루보틀 카페가 있다.
  </>
);

const P = () => <>전전, 화공, 토목이 사용하는 건물. </>;

const Q = () => (
  <>
    컴퓨터 수업하는 강의실이 있다. 상담센터나 취업지원센터, 과사무실 등등이 있다. 주로 여학생
    휴게실에 갈 때 지나치는 길목으로, 학생회관과 F동을 연결하는 길이기도 하다.
  </>
);

const MH = () => (
  <>
    홍익대학교라는 글씨가 박혀있는 학교의 본관. 여러가지 행정부서가 위치한다. 4층의 현대미술관은
    주로 졸업전시 장소로 애용된다. 16층의 교직원 식당은 비싸지만 학식 중 제일 좋다는 평이 있다.
    8층은 F동 6층으로 연결된다.
  </>
);

const F = () => (
  <>
    회화과와 판화과가 사용하는 건물. 강의실 천장이 붕괴되는 사건이 있었고, 2017년쯤 리모델링되었다.
    앞의 롱다리계단은 담배존이기도 하고, 각 과의 해오름식이 진행되는 공간이기도 하다.
    <br />
    6층에 문헌관이랑 이어지는 통로 옆 옥상은 작업하다가 숨 돌리러 자주가는 F동의 핫플레이스이다.
  </>
);

const E = () => <>산디, 금디, 목조, 도유 등 미대가 사용하는 건물.</>;

const U = () => (
  <>
    2016년에 건축된 비교적 신축건물. 동양화과 등이 사용하고, 저층에 공동실기실이 위치한다. 미대생
    1학년들이 기초입체, 기초평면 등의 전공기초 수업을 듣는다.
  </>
);

const ABCD = () => (
  <>
    경영대학, 문과대학, 사범대학, 경제학부가 위치한다.
    <br />
    C동: 교양수업의 성지. 8층의 학생 휴게실은 줄여서 C8이라고 불리는데 매점에서 파는 C8우동이
    유명하다. 엘레베이터가 진짜 안 오고, 엘레베이터마다 가는 층이 달라서 혼란스러운 미로같은
    건물이다. 1층이나 3층 등으로 외부로 통한다.
    <br />
    B동: 리모델링 후 입구에 카페가 생겼다. 핫도그가 맛있기로 유명하다. 앞의 벚꽃나무가 예쁘기로
    유명해서 테라스에서 벚꽃 사진을 많이 찍는다.
    <br />
    D동: 공연관련 동아리방, 남학생휴게실이 위치해 있다.
  </>
);

const DORM = () => (
  <>
    2016년에 신축된 홍익대학교 제2기숙사. 제3기숙사가 건설된 지금도 신긱이라고 불리는 공간이다.
    학교에서 제일 높은 건물이고, 원래는 이 자리에 잔디축구장이 있었다고 한다.
    <br />
    신기숙사 식당 운영 첫 해에, 기숙사 다니는 친구들한테 식권사면 좀 싸게 먹을 수 있었는데 이제는
    전산으로 처리돼서 판매할 수 없게 되었다고 한다. 전산으로 바뀌기 전 마지막 학기에는 식권이 장당
    1500원까지 떨어졌다고도 한다. 항상 샐러드바에 사과가 나왔던 기억이 있다.
  </>
);

const T = () => (
  <>
    컴공과 산공이 사용하는 건물. 24시간 개방하는 열람실이 3층과 4층에 있다. 지하 연습실에서 여가레
    수업을 한다. 여러 댄스 소모임/동아리들도 여기서 많이 연습한다.
    <br />
    지하 1층부터 2층에는 층간에 걸쳐있는 계단식 강의실들이 있어 헷갈리기 쉽다. 강의실 앞문은 밑층,
    뒷문은 위층으로 연결된다.
  </>
);

const S = () => (
  <>
    지어진지 20년이 지났는데 아직도 신축강당이라고 불리는 의문의 장소. 신문사와 ROTC가 위치해 있다.
    강당은 주로 전시공간으로 사용되어 여러 졸업전시나 과제전이 진행된다. 강당을 거쳐 T동 5층으로
    연결되는 구름다리가 있다.
  </>
);

const Z = () => (
  <>
    원래 홍대부속 초등학교, 여중, 여고였던 건물, 2012년 리모델링 후 지금의 모습이 되었다.
    <br />
    학교 내 건물을 리모델링 할때 이곳으로 피신오는 경우가 잦다. F동 리모델링때 그곳을 쓰던
    미대생들이 썼고, A동 B동 리모델링을 하면 경영에서 사용중이다.
  </>
);

const M = () => (
  <>
    체육관으로, 현재는 폐쇄된 수영장이 있다. 동아리 박람회나 문화제 등 행사가 열리기도 한다. 1층에는
    카페가 있다.
  </>
);

const PG = () => (
  <>
    축제만 하면 다섯배는 넓어보이는 운동장. 무대 세개에 각 과별 주점, 동아리 부스가 다 들어가는 것이
    신기하다.
    <br />
    여기서 바라보는 노을이 예쁜데, 홍대의 예쁜 분홍색 노을은 사실 대기오염때문이라고 한다. 현재는
    공사중이다.
  </>
);

const YM = () => (
  <>
    홍대를 대표하는 조형물로 1971년에 지어진 유서깊은 학교의 상징이다. 새내기때 머리 부분이
    돌아가는지 안 돌아가는지 갑론을박이 있었다. 많은 새내기들이 선배들이 하는 거짓말인줄 알지만,
    사실 진짜로 돌아간다. 지하에서 대학원생들이 수동으로 돌린다는 카더라가 있다. 최근 화살표의
    머리부분이 부러지고 방치되고 있다.
  </>
);

const DD = () => (
  <>
    동그랑땡을 닮아 동땡이라 불리는 구조물. 사실 지하 건물인 Z1동 (구 홍익여고)에 자연광을 채광하는
    용도이다. 2013년도 이전에는 저기 동그랗게 모여앉아 음식을 배달해 먹거나, 고기를 구워먹거나, 술
    마셨다고 한다.
  </>
);

const detailContent = {
  [Building.R]: <R />,
  [Building.K]: <K />,
  [Building.L]: <L />,
  [Building.J]: <J />,
  [Building.I]: <I />,
  [Building.G]: <G />,
  [Building.H]: <H />,
  [Building.P]: <P />,
  [Building.Q]: <Q />,
  [Building.MH]: <MH />,
  [Building.F]: <F />,
  [Building.E]: <E />,
  [Building.U]: <U />,
  [Building.ABCD]: <ABCD />,
  [Building.DORM]: <DORM />,
  [Building.T]: <T />,
  [Building.S]: <S />,
  [Building.Z]: <Z />,
  [Building.M]: <M />,
  [Building.PG]: <PG />,
  [Building.YM]: <YM />,
  [Building.DD]: <DD />,
};

export default detailContent;
